Repository: murank/wxwidgetsjp
Catalog: wxwidgetsjp-level2.tmx
Source language: en_us
Languages: ja

source: The amount of memory allocated is configured by the setting of EXTRA_ALLOC in the file string.cpp during compilation (be sure to understand why its default value is what it is before modifying it!).
ja: 割り当てられるメモリの量は string.cpp ファイルの EXTRA_ALLOC を変更することでコンパイル時に設定することができます。(値を変更する前に、なぜデフォルト値がその値になっているのかをよく理解するようにしてください!)

source: The application normally shuts down when the last of its top level windows is closed.
ja: 通常、アプリケーションは最後のトップレベルウィンドウが閉じられたときに終了します。

source: The automatically generated identifiers are always negative and so will never conflict with the user-specified identifiers which must be always positive.
ja: 自動生成される識別子は常に負の値のため、必ず正の値でなければならないユーザ定義の識別子と衝突することはありません。

source: The base class for all these conversions is the wxMBConv class (which itself implements standard libc locale conversion).
ja: これらすべての変換の基底クラスが wxMBConv クラスです。(このクラス自身では標準 libc ロケールの変換を実装しています)

source: The basic idea behind a wxBoxSizer is that windows will most often be laid out in rather simple basic geometry, typically in a row or a column or several hierarchies of either.
ja: wxBoxSizer の基本的な考え方は、ほとんどの場合ウィンドウは とても単純で基本的な配置、よくあるのは行や列、またはその階層内にレイアウトされるという考えです。

source: The basic idea behind a box sizer is that windows will most often be laid out in rather simple basic ...
ja: ボックスサイザーの基本的な考え方は、ほとんどの場合ウィンドウは とても単純で基本的な配置、よくあるのは行や列、またはその階層内にレイアウトされるという考えです。

source: The basic idea behind a box sizer is that windows will most often be laid out in rather simple basic geometry, typically in a row or a column or several hierarchies of either.
ja: ボックスサイザーの基本的な考え方は、ほとんどの場合ウィンドウは とても単純で基本的な配置、よくあるのは行や列、またはその階層内にレイアウトされるという考えです。

source: The best way to ensure correctly displayed texts in a GUI across platforms is to use locales.
ja: プラットフォームをまたがって GUI に正しくテキストを表示する最善の方法はロケールを使用することです。

source: The button handler should return immediately if validation failed.
ja: ボタンハンドラは検証に失敗した場合に直ちに呼び出し元へ戻る必要があります。

source: The calendar control allows the user to pick a date.
ja: カレンダコントロールはユーザが日付を選択できるようにします。

source: The catalog is then converted to the charset used (see wxLocale::GetSystemEncoding and wxLocale::GetSystemEncodingName) by the user's operating system.
ja: そして、ユーザのオペレーティングシステムで使用されている文字コード (wxLocale::GetSystemEncoding と wxLocale::GetSystemEncodingName 参照) へカタログが変換されます。

source: The change of the type of wxString::c_str() can also result in compilation errors when passing its result to a function overloaded to take both narrow and wide strings and in this case you must select the version which you really want to use, e.g.:
ja: また、wxString::c_str() の戻り値の型を変更したことで、ナロー文字列とワイド文字列の両方を受け取るオーバーロード関数にこの戻り値を引き渡すとコンパイルエラーが発生するようになります。この場合はどちらの型を使用したいか選択する必要があります:

source: The child frame classes send the event directly to the associated view which still forwards it to its document object.
ja: 子フレームクラスはイベントを関連するビューへ直接送信し、このビューがさらに関連するドキュメントへイベントを転送します。

source: The client object will call OnMakeConnection to create a connection object of the derived class if the connection is successful.
ja: 接続に成功するとクライアントオブジェクトは継承したコネクションクラスのオブジェクトを作成するために OnMakeConnection を呼び出します。

source: The config classes provide a way to store some application configuration information.
ja: コンフィグクラスではアプリケーションの設定情報を格納するための方法を提供します。

source: The connection object is then used for sending and receiving subsequent messages between client and server - overriding virtual functions in your class derived from wxConnection allows you to handle the DDE messages.
ja: 作成されたコネクションオブジェクトはクライアント・サーバ間でのメッセージの送受信に使用されます。このとき、wxConnection を継承したクラスで仮想関数をオーバーライドすると DDE メッセージを処理することができます。

source: The core: wxStreamBase, wxStreamBuffer, wxInputStream, wxOutputStream, wxFilterInputStream, wxFilterOutputStream
ja: コアクラス: wxStreamBase, wxStreamBuffer, wxInputStream, wxOutputStream, wxFilterInputStream, wxFilterOutputStream

source: The custom wxConnection class will receive communications in a 'conversation' with a server.
ja: wxConnection の継承クラスはサーバとの '会話' (conversation) におけるやり取りを受信します。

source: The data was successfully copied.
ja: データのコピーに成功した。

source: The data was successfully moved (MSW only).
ja: データの移動に成功した。(MSW のみ)

source: The default DoGetBestSize() is designed for use in container windows, such as wxPanel, and works something like this:
ja: デフォルトの DoGetBestSize() は wxPanel といったコンテナウィンドウに使用するために設計されており、それはこのように動作します:

source: The default algorithm assumes that memory allocation is done in granularity of at least 16 bytes (which is the case on almost all of wide-spread platforms) and so nothing is lost if the amount of memory to allocate is rounded up to the next multiple of 16.
ja: デフォルトのアルゴリズムでは少なくとも 16 バイト単位でメモリの割り当てが行われると仮定している (これは広く使われているほぼすべてのプラットフォームで当てはまります) ため、メモリの割り当て量が 16 の倍数に切り上げられたとしても何も無駄になりません。

source: The default approach is quite conservative.
ja: このデフォルトのやり方は非常に保守的です。

source: The default close event handler for wxDialog simulates a Cancel command, generating a wxID_CANCEL event.
ja: wxDialog のデフォルトの終了イベントハンドラは wxID_CANCEL イベントを生成する Cancel コマンドを模倣します。

source: The default close event handler for wxFrame destroys the frame using Destroy().
ja: wxFrame のデフォルトの終了ハンドラは Destroy() を使用してフレームを破棄します。

source: The default data type is wxCF_TEXT (ASCII text), and the default data size is the length of the null-terminated string.
ja: デフォルトのデータ型は wxCF_TEXT (ASCII テキスト) で、デフォルトのデータサイズはヌル終端文字列の文字列長です。

source: The default handler for the wxEVT_INIT_DIALOG event is defined in the wxWindow class to simply call the function wxWindow::TransferDataToWindow.
ja: wxEVT_INIT_DIALOG イベントのデフォルトのイベントハンドラが wxWindow クラスの中で定義されており、これは単純に wxWindow::TransferDataToWindow 関数を呼ぶだけです。

source: The default handler for wxID_CANCEL hides the dialog (if modeless) or calls EndModal(wxID_CANCEL) (if modal).
ja: wxID_CANCEL のデフォルトハンドラは (モードレスの場合に) ダイアログを非表示にするか、(モーダルの場合に) EndModal(wxID_CANCEL) を呼びます。

source: The default is 640x480-16.
ja: デフォルトは 640x480-16 です。

source: The default processing is to pop up a message box to inform the user about it.
ja: デフォルトの処理ではメッセージボックスをポップアップして通知します。

source: The design which uses one GUI thread and several worker threads which communicate with the main one using events is much more robust and will undoubtedly save you countless problems (example: under Win32 a thread can only access GDI objects such as pens, brushes, device contexts created by itself and not by the other threads).
ja: ひとつの GUI スレッドと複数のワーカースレッドを使用し、イベント を使用してメインスレッドと通信するデザインはよりロバストで、無数の問題が起こるのを間違いなく防いでくれます。(例: Win32 では自スレッドで作成した GDI オブジェクト (ペンやブラシなど) にだけアクセスでき、他スレッドで作成したオブジェクトにはアクセスできません)

source: The design which uses one GUI thread and several worker threads which communicate with the main one using events is much more robust and will undoubtedly save you countless problems (example: under Win32 a thread can only access GDI objects such as pens, brushes, &c created by itself and not by the other threads).
ja: ひとつの GUI スレッドと複数のワーカースレッドを使用し、イベントを使用してメインスレッドと通信するデザインはよりロバストで、無数の問題が起こるのを間違いなく防いでくれます。(例: Win32 では自スレッドで作成した GDI オブジェクト (ペンやブラシなど) にだけアクセスでき、他スレッドで作成したオブジェクトにはアクセスできません)

source: The details of event propagation up the window hierarchy are described in the next section.
ja: ウィンドウ階層内におけるイベント伝播についての詳細は次の章で述べます。

source: The device context is intended to represent a number of output devices in a generic way, with the same API being used throughout.
ja: デバイスコンテキストは汎用的な方法で、つまり同じ API を通して操作できる多くの出力デバイスを表現することを目的としています。

source: The dialog does custom painting and/or event handling not handled by the scrolled window.
ja: ダイアログでカスタムドローを行なっている。スクロール可能なウィンドウではイベント処理が行われません。

source: The dialog doesn't use sizers.
ja: ダイアログでサイザーを使用していない。

source: The dialog has unusual layout, for example a vertical sizer containing a mixture of standard buttons and other controls.
ja: 標準ボタンと他のコントロールが混在する垂直方向のサイザーなど、通常とは異なるレイアウトを持っている。

source: The dialog implementation makes assumptions about the window hierarchy, for example getting the parent of a control and casting to the dialog class.
ja: コントロールの親をダイアログにキャストするなど、ダイアログの実装でウィンドウの階層構造について仮定を立てている。

source: The dialog makes assumptions about the sizer hierarchy, for example to show or hide children of the top-level sizer.
ja: トップレベルサイザーの子コントロールの表示・非表示を切り替えるなど、サイザーの階層構造について仮定を立てている。

source: The documentation for specific event macros is organised by event class.
ja: このドキュメントではイベントマクロをイベントクラスごとに分類しています。

source: The easiest workaround is to give a name to the enum.
ja: もっとも簡単な回避方法としては enum に名前をつけることです。

source: The event base class
ja: イベントの基底クラス

source: The event handler function might look like this:
ja: イベントハンドラ関数は以下のようになります:

source: The event is passed to the next event handler, if any, in the event handler chain, i.e., the steps (1) to (4) are done for it.
ja: イベントハンドラの連鎖内において、次のイベントハンドラが存在する場合、次のイベントハンドラへイベントを引き渡します。つまり、そのイベントハンドラに対してステップ (1) から (4) を行います。

source: The event table containing all the handlers defined using the event table macros in this class and its base classes is examined.
ja: このクラスと基底クラスで (イベントテーブルマクロによって) 定義されたすべてのイベントハンドラを含むイベントテーブルを調べます。

source: The event table tells wxWidgets how to map events to member functions and in our example it could look like this:
ja: イベントテーブルはイベントとメンバ関数のマッピングを wxWidgets へ知らせるものであり、以下のようになります:

source: The events do propagate beyond the frames, however.
ja: しかし、通常のイベントはフレームを超えて伝播します。

source: The first function, as almost all the other functions in lowercase, is std::string compatible.
ja: 他の小文字の関数のほとんどがそうであるように、最初の関数は std::string と互換性があります。

source: The first is in the call to the printf() function.
ja: 最初のバグは printf() 関数の呼び出し部分に存在します。

source: The first of them should be only used for the string containing 7-bit ASCII characters only, anything else will be replaced by some substitution character.
ja: 最初の関数は文字列に 7 ビット ASCII 文字のみが含まれる場合にだけ使用してください。ASCII 文字以外の文字はなんらかの置換文字に置き換えられます。

source: The first one is the most flexible and allows you to change the formatting of the messages, dynamically filter and redirect them and so on -- all log messages, except for those generated by wxLogFatalError(), pass by this function.
ja: 最初の関数はもっとも柔軟で、メッセージ形式の変更、メッセージの動的なフィルタリングやリダイレクトなどを行なうことができます。wxLogFatalError() で生成されたメッセージを除いて、すべてのメッセージがこの関数に引き渡されます。

source: The first one may be overridden to do whatever you want but you have to distinguish between the different message types yourself.
ja: 最初の関数をオーバーライドすると何でもできますが、異なるメッセージ型を自分で区別する必要があります。

source: The first two entries map menu commands to two different member functions.
ja: 最初の 2 つのエントリはメニューコマンドを異なる 2 つのメンバ関数にマッピングしています。

source: The following describes the differences between these device contexts and when you should use them.
ja: 各デバイスコンテキストの違いと、それを使用するタイミングについて以下で説明します。

source: The following description refers to wx... but remember that the equivalent wxTCP... and wxDDE... classes can be used in much the same way.
ja: 以降の説明では wx... という名称を使用しますが、同じ wxTCP... クラスと wxDDE... クラスは同様の方法で使用できることを覚えておいてください。

source: The following description refers to wxWidgets, but remember that the equivalent wxTCP* and wxDDE* classes can be used in much the same way.
ja: 以降の説明では wxWidgets について言及しますが、同じ wxTCP* クラスと wxDDE* クラスは同様の方法で使用できることを覚えておいてください。

source: The following flags can be passed to this function:
ja: この関数には以下のフラグを指定できます:

source: The following lists the formats handled on different platforms.
ja: 各プラットフォームで対応している形式の一覧を以下に示します。

source: The following sample shows a dialog with three buttons, the first one has a stretch factor of 1 and thus gets stretched, whereas the other two buttons have a stretch factor of zero and keep their initial width:
ja: 以下に 3 個のボタンを持つダイアログの例を示します。最初のボタンはストレッチ係数に 1 を指定しているため、サイズが伸長していますが、他のふたつのボタンはストレッチ係数が 0 のため、初期サイズを維持しています:

source: The following sample shows a listbox and three buttons in a horizontal box sizer; one button is centred, one is aligned at the top, one is aligned at the bottom:
ja: 以下に水平方向のボックスサイザー内にリストボックスと 3 個のボタンを配置した場合の例を示します; それぞれのボタンは中央寄せ、上寄せ、下寄せです:

source: The following sample shows the same dialog as in the last sample, only the box sizer is a vertical box sizer now:
ja: 以下の例は最後の例と同じダイアログですが、ボックスサイザーが垂直方向のボックスサイザーとなっています。

source: The following sample shows the same dialog as the one above, but using a flex grid sizer:
ja: 以下の例は上の例と同じダイアログですが、可変グリッドサイザーを使用しています。

source: The following samples show dialogs with only one dialog item (a button) and a border of 0, 5, and 10 pixels around the button:
ja: 以下の例では単一のコントロール (ボタン) を持つダイアログについて、ボタンのまわりのボーダーを 0、5、10 ピクセルに設定しています。

source: The following sections briefly describe how to program with individual sizer classes.
ja: 続く章では個々のサイザークラスを用いてプログラムを書く方法について簡潔に説明します。

source: The following standard identifiers are supplied.
ja: 標準識別子には以下のものが用意されています。

source: The full class declaration might look like this:
ja: 完全なクラス宣言は以下のようになります:

source: The functions below allow some limited customization of wxLog behaviour without writing a new log target class (which, aside from being a matter of several minutes, allows you to do anything you want).
ja: 以下の関数は新しいログターゲットを作成することなく、wxLog の振る舞いを限定的に変更することができます。

source: The functions to use for error messages, i.e.
ja: エラーメッセージ用の関数です。

source: The gettext Manual: http://www.gnu.org/software/gettext/manual/gettext.html
ja: gettext マニュアル: http://www.gnu.org/software/gettext/manual/gettext.html

source: The handler for EVT_CLOSE should signal to the calling code if it does not destroy the window, by calling wxCloseEvent::Veto.
ja: ウィンドウを破棄しない場合、EVT_CLOSE ハンドラで wxCloseEvent::Veto を呼び出し、呼び出し元へそのことを通知するようにしてください。

source: The implicit cast is used again, so the code compiles, but as it returns a pointer to a buffer belonging to a local variable which is deleted as soon as the function exits, its contents are completely arbitrary.
ja: 暗黙的な変換が再度行われるため、コードはコンパイルできますが、返却されるポインタはローカル変数のバッファを指すことになります。そして、このローカル変数は関数を抜けるとすぐに破棄されるため、その内容は完全に不定になります。

source: The implicit cast is used again, so the code compiles, but as it returns a pointer to a buffer belonging to a local variable which is deleted as soon as the function exits, its contents is totally arbitrary.
ja: 暗黙的な変換が再度行われるため、コードはコンパイルできますが、返却されるポインタはローカル変数のバッファを指すことになります。そして、このローカル変数は関数を抜けるとすぐに破棄されるため、その内容は完全に不定になります。

source: The important conclusion is that if you use wxChar instead of char, avoid using C style strings and use wxString instead and don't forget to enclose all string literals inside wxT() macro, your program automatically becomes (almost) Unicode compliant!
ja: 重要な結論としては、char の代わりに wxChar を使い、 C 形式の文字列ではなく wxString を使い、すべてのリテラル文字列を wxT() マクロで囲むのを忘れなければ、あなたのプログラムは自動的に (ほぼ) Unicode 準拠になるということです!

source: The incompatible changes can be grouped into the following categories:
ja: 互換性のない変更は次のカテゴリに分類できます:

source: The interface provided by wxString is the same independently of the format used internally.
ja: wxString の提供するインタフェースはその内部フォーマットによらず、同一です。

source: The last method is the simplest one: you should override it if you simply want to redirect the log output elsewhere, without taking into account the level of the message.
ja: 最後の関数が一番単純です: メッセージのログレベルを考慮せず、単純にログ出力を他の場所へリダイレクトしたい場合はこの関数をオーバーライドします。

source: The last two modes override the global adaptation setting.
ja: 最後のふたつのモードは適応に関するグローバルな設定を上書きします。

source: The layout algorithm used by sizers in wxWidgets is closely related to layout systems in other GUI toolkits, such as Java's AWT, the GTK toolkit or the Qt toolkit.
ja: wxWidgets のサイザーで用いられているレイアウトアルゴリズムは Java の AWT や GTK ツールキット、 Qt ツールキットといった他の GUI ツールキットで用いられているものと密接に関わりがあります。

source: The list of dynamically bound event handlers, i.e., those for which Bind<>() was called, is consulted.
ja: 動的イベントハンドラ (つまり、Bind<>() でバインドしたイベントハンドラ) の一覧を調べます。

source: The log targets can also be combined: for example you may wish to redirect the messages somewhere else (for example, to a log file) but also process them as normally.
ja: ログターゲットは組み合わせて使用することもできます: 例えば、メッセージを他の場所 (例えばログファイルなど) にリダイレクトしつつ、通常通りの方法でも処理したいとします。

source: The log window frame has a menu allowing user to clear the log, close it completely or save all messages to file.
ja: ログウィンドウフレームはメニューを持ち、ログの消去、終了、メッセージの保存を選択することができます。

source: The logging facilities included in wxWidgets provide the base wxLog class which defines the standard interface for a log target as well as several standard implementations of it and a family of functions to use with them.
ja: wxWidgets のロギング機能では ログ ターゲットに対する標準的なインタフェースを定義する基底 wxLog クラスや、いくつかのログクラスの標準的な実装とそれを使用する関数群を提供しています。

source: The macro wxWX2MBbuf reflects the correct return value of cWX2MB (either char* or wxCharBuffer), except for the const.
ja: (wxWX2MBbuf マクロは const でないことを除いて、cWX2MB の戻り値 (char* または wxCharBuffer) と同じ型になります)

source: The most important advantage is the need to always remember to allocate/free memory for C strings; working with fixed size buffers almost inevitably leads to buffer overflows.
ja: もっとも重要な利点は、C 文字列の場合、メモリの割り当てと解放を忘れずに行なう必要がある点です; また、固定サイズのバッファを使用すると大抵バッファオーバーランを引き起こします。

source: The most important one is probably that there are often several functions to do exactly the same thing: for example, to get the length of the string either one of wxString::length(), wxString::Len() or wxString::Length() may be used.
ja: もっとも重要な問題はおそらく、まったく同じことを行なう関数が複数存在することです: 例えば、文字列の長さを取得するために wxString::length()、wxString::Len()、wxString::Length() のどれでも使用できます。

source: The most important one is probably that there are often several functions to do exactly the same thing: for example, to get the length of the string either one of length(), Len() or Length() may be used.
ja: もっとも重要な問題はおそらく、まったく同じことを行なう関数が複数存在することです: 例えば、文字列の長さを取得するために length()、Len()、Length() のどれでも使用できます。

source: The most serious backwards-incompatible change is related to the change of return type of wxString::c_str() method: it returns a special proxy object instead of a simple char* or wchar_t* now.
ja: もっとも深刻な後方互換性のない変更は wxString::c_str() 関数の戻り値の型に関する変更です: 現在は単純な char* や wchar_t* の代わりに特別なプロキシオブジェクトを返却します。

source: The native implementation is used by default, but you can still use wxGenericCalendarCtrl instead of wxCalendarCtrl in your code if you need the extra features.
ja: デフォルトでネイティブ実装が使用されますが、追加の機能が必要な場合は wxCalendarCtrl の代わりに wxGenericCalendarCtrl を引き続き使用できます。

source: The next four lines define bindings of individual events to their handlers: the first two of them map menu commands from the items with the identifiers specified as the first macro parameter to two different member functions.
ja: 次の 4 行は個々のイベントにおけるイベントハンドラへのバインディングを定義しています: 最初のふたつはマクロの第 1 引数で指定された識別子を持つ項目のメニューコマンドを、ふたつの異なるメンバ関数にマッピングしています。

source: The next section describes and shows what can be done with sizers.
ja: 次の章ではサイザーを用いて何ができるのかを説明します。

source: The next thing to do is to decide whether you need to define a custom event class for events of this type or if you can reuse an existing class, typically either wxEvent (which doesn't provide any extra information) or wxCommandEvent (which contains several extra fields and also propagates upwards by default).
ja: 次に行なうことは、このイベント型用のカスタムイベントクラスを定義する必要があるかどうか、もしくは既存のクラス、通常は (追加の情報を持たない) wxEvent か （いくつかの追加フィールドを持ち、デフォルトで伝播する) wxCommandEvent のどちらかを再利用できるかどうかを決定することです。

source: The normal order of event table searching by ProcessEvent is as follows:
ja: ProcessEvent によるイベントテーブルの検索は通常、以下の順番で行われます：

source: The normal order of event table searching by ProcessEvent() is as follows, with the event processing stopping as soon as a handler is found (unless the handler calls wxEvent::Skip() in which case it doesn't count as having handled the event and the search continues):
ja: 通常、ProcessEvent() によるイベントテーブルの検索順は以下のように行われ、イベントハンドラが見つかると処理を終了します。 (ただし、イベントハンドラで wxEvent::Skip() を呼ぶとイベントが処理されていないものとして扱われ、引き続き検索が行われます):

source: The normal usage of a log object (i.e. object of a class derived from wxLog) is to install it as the active target with a call to SetActiveTarget() and it will be used automatically by all subsequent calls to wxLogXXX() functions.
ja: ログオブジェクト (つまり、wxLog を継承したクラスのオブジェクト) の通常の使用方法は SetActiveTarget() を使用して有効なターゲットとして設定することで、それ以降に呼び出された wxLogXXX() 関数で自動的に使用されるようになります。

source: The objects of this class may be instantiated to (temporarily) suppress output of wxLogXXX() functions.
ja: このクラスのオブジェクトは wxLogXXX() 関数の出力を (一時的に) 抑制する場合にインスタンス化されます。

source: The only exceptions to this rule are:
ja: このルールの 例外 は以下のとおりです:

source: The only requirement imposed by wxWidgets is that this class must derive from wxEvtHandler and so, considering that wxWindow derives from it, any classes representing windows can handle events.
ja: wxWidgets が唯一要求することとして、イベントを処理するクラスは wxEvtHandler を継承していなければなりません。したがって、wxWindow はこのクラスを継承していることを考慮すると、ウィンドウを表すクラスはどれもイベントを処理することができるということです。

source: The other class of incompatible changes is due to modifying some virtual methods to use wxString parameters instead of const wxChar* ones to make them accept both narrow and wide strings.
ja: 他の互換性のない変更は、いくつかの仮想関数を const wxChar* の代わりに wxString を引数に取るように修正したことによるものです。この変更はナロー文字列とワイド文字列の両方を受け取るために行いました。

source: The other is to use the existing event classes and give them an new event type.
ja: もう一方の方法は、既存のイベントクラスを使用し、それらに新しいイベント型を与える方法です。

source: The other one uses wxEvtHandler::Bind<>() call and can be used to bind and unbind, the handlers dynamically, i.e. during run-time depending on some conditions.
ja: もう一方は wxEvtHandler::Bind<>() を使用する方法で、動的に (実行時に条件に基づいて) ハンドラをバインドしたり解除したりできます。

source: The other planes in fact contain mainly historic scripts, special-purpose characters or are unused.
ja: 実際のところ、他の面は主に歴史上の文字や特殊用途の文字用か、もしくは使用されていません。

source: The overhead of such conversions is usually negligible for small strings but may be important for some programs.
ja: この変換にかかるオーバーヘッドは小さな文字列であれば無視できるものですが、いくつかのプログラムでは重要になるかもしれません。

source: The parent frame classes modify step (2) above to send the events received by them to wxDocManager object first.
ja: 親フレームクラスでは上記のステップ (2) において、受信したイベントをまず wxDocManager オブジェクトに送信するように変わります。

source: The path components are always separated with a slash, even though some implementations use the backslash internally.
ja: パスの要素は 常に スラッシュで区切られます。一部の実装で内部的にバックスラッシュを使用していてもこれは変わりません。

source: The possibilities of handling events in this way are rather different.
ja: この方法ではイベント処理のやり方が大きく異なります。

source: The predefined wxCSConv instance, wxConvLocal, is preset to use the default user character set, but you should rarely need to use it directly, it is better to go through wxConvCurrent.
ja: 事前に定義された wxCSConv インスタンスである wxConvLocal はデフォルトのユーザ文字コードを使用するように設定されていますが、これを直接使用する必要はほとんどなく、それよりも wxConvCurrent を使用するべきです。

source: The previous elements in the path are the group names, and each name may contain an arbitrary number of entries and subgroups.
ja: パスの前の要素はグループ名です。各グループには任意の数のエントリやサブグループが含まれます。

source: The previous sections explain how to define event handlers but don't address the question of how exactly wxWidgets finds the handler to call for the given event.
ja: 前の章ではイベントハンドラの定義方法について説明しましたが、wxWidgets がどのようにイベントハンドラを探すのかについてはまだ述べていません。

source: The probably first example is Windows NT which uses only Unicode internally since its very first version.
ja: おそらく、最初の例は Windows NT でしょう。 Windows NT ではかなり初期のバージョンから内部的に Unicode を使用しています。

source: The problems can be separated into three broad classes:
ja: 発生しうる問題は大まかに 3 種類に分類することができます:

source: The program i18n involves several steps:
ja: プログラムの国際化にはいくつかのステップが含まれます:

source: The rationale for this choice is that there are only a few frames in a typical application and their parent-child relation are well understood by the programmer while it may be difficult, if not impossible, to track down all the dialogs that may be popped up in a complex program (remember that some are created automatically by wxWidgets).
ja: このようにした理由は、普通のアプリケーションでは数個のフレームしか存在せず、プログラマはそれらの親子関係のことをよく理解している一方で、複雑なプログラムで表示されるすべてのダイアログを追跡することは、不可能でないにしても非常に難しいためです。 (いくつかのダイアログは wxWidgets によって自動的に生成されることを思い出してください)
